Staggerd2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    fb
    {
        type            empty;
        physicalType    patch;
        nFaces          6278;
        startFace       35611;
    }
    fw
    {
        type            wall;
        physicalType    patch;
        nFaces          365;
        startFace       41889;
    }
    sym
    {
        type            symmetry;
        physicalType    patch;
        nFaces          290;
        startFace       42254;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          160;
        startFace       42544;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          160;
        startFace       42704;
    }
)

// ************************************************************************* //
